Repository: ferrous-systems/why-ferrocene
Catalog: po/*.po
Languages: es

source: Summary
es: Resumen

source: Front Matter
es: Portada

source: What is Ferrocene?
es: ¿Qué es Ferrocene?

source: Ferrocene is just Rust
es: Ferrocene sólo es Rust

source: The downstream model
es: El modelo downstream

source: The supported host platforms
es: Las plataformas host soportadas

source: The supported target platforms
es: las plataformas target soportadas

source: ISO 26262 Qualification
es: Calificación ISO 26262

source: Commercial Support
es: Soporte Comercial

source: A Live Demo
es: Live Demo

source: Installing Ferrocene today
es: Instalación actual de Ferrocene

source: Exploring the installation
es: Explorando la instalación

source: Writing and running a program
es: Escribiendo y corriendo un programa

source: Q&A
es: Preguntas y Respuestas

source: Wash-up
es: Conclusión

source: Introduction
es: Introducción

source: In this introductory session titled _Why Ferrocene?_ you will learn what Ferrocene is about, where it is from and where it is going, and whether it is right for you to look at Ferrocene for your next security-related or safety-critical project. The agenda includes a short lecture, a live programming demonstration, and a Q&A session.
es: En esta sesión introductoria titulada _¿Por qué Ferrocene?_ vas a aprender de qué trata Ferrocene, de dónde salió, hacia dónde va, y si es apropiado para tí usar Ferrocene en tu próximo proyecto relacionado a seguridad o de seguridad crítica. La sesión incluye una breve plática, una demostración de programación en vivo y una sesión de preguntas al final.

source: We conduct all training sessions remotely using modern video-conferencing tools to ensure the best learning experience.
es: Llevamos a cabo todas las sesiones de entrenamiento de manera remota con herramientas modernas de video-conferencias para asegurarnos de la mejor experiencia educativa.

source: This repository contains the teaching material for this course.
es: Este repositorio contiene el material de enseñanza para este curso.

source: Learning Goals
es: Metas de aprendizaje

source: These are the questions you will be able to answer after attending this course:
es: Estas son las preguntas que podrás responder después de acudir a este curso:

source: Is Ferrocene a fork of Rust?
es: ¿Es Ferrocene un fork de Rust?

source: What support is available for Ferrocene?
es: ¿Qué soporte hay disponible para Ferrocene?

source: What is it like using Ferrocene?
es: ¿Cómo es la experiencia de usar Ferrocene?

source: Timetable
es: Horario

source: Our standard timetable for this course is as follows:
es: Nuestro horario estándar es el siguiente:

source: Duration
es: Duración

source: Contents
es: Contenido

source: Room open, meet and greet
es: Sesión de apertura, meet and greet

source: Session 1 - What is Ferrocene?
es: Sesión 1 - ¿Qué es Ferrocene?

source: Break
es: Descanso

source: Session 2 - A Live Demo
es: Sesión 2 - Live Demo

source: Q&A and Close
es: Preguntas, Respuestas, y Conclusiones

source: No, really...
es: No, es neta...

source: We didn't write a new Rust toolchain
es: No escribimos un nuevo toolchain de Rust

source: We qualified The Rust Toolchain
es: Cualificamos El Toolchain de Rust

source: Non-divergence
es: No-divergencia

source: One of the Ferrocene pillars is that the standard library and the compiler must not diverge from upstream.
es: Uno de los pilares de Ferrocene es que la librería estándar y el compilador no deben divergir del upstream.

source: The model works
es: El model funciona

source: We've been doing this since 2021, backporting the `master` branch of `rust-lang/rust` into our tree.
es: Llevamos haciendo esto desde 2021, haciendo backport de la rama `master` de`rust-lang/rust` a nuestro árbol de trabajo.

source: Patches
es: Parches

source: Of course, some changes were required
es: Claro, se necesitaron algunos cambios

source: So, we upstreamed all of them
es: Entonces los pusimos todos en upstream

source: Like [\#93717](https://github.com/rust-lang/rust/pull/93717), [\#108659](https://github.com/rust-lang/rust/pull/108659), [\#111936](https://github.com/rust-lang/rust/pull/111936), [\#108898](https://github.com/rust-lang/rust/pull/108898)...
es: Como [\#93717](https://github.com/rust-lang/rust/pull/93717), [\#108659](https://github.com/rust-lang/rust/pull/108659), [\#111936](https://github.com/rust-lang/rust/pull/111936), [\#108898](https://github.com/rust-lang/rust/pull/108898)...

source: Virtuous Cycle
es: Ciclo Virtuoso

source: Sometimes we find bugs that upstream missed
es: A veces encontramos bugs que perdió upstream

source: So we upstreamed the fixes
es: Y les upstreameamos los fixes

source: Like [\#108905](https://github.com/rust-lang/rust/pull/108905) or [\#114613](https://github.com/rust-lang/rust/pull/114613).
es: Como [\#108905](https://github.com/rust-lang/rust/pull/108905) or [\#114613](https://github.com/rust-lang/rust/pull/114613).

source: So what's left?
es: Entonces, ¿qué queda?

source: Support for the [LynxOS-178](https://www.lynx.com/products/lynxos-178-do-178c-certified-posix-rtos) target
es: Soporte para el target[LynxOS-178](https://www.lynx.com/products/lynxos-178-do-178c-certified-posix-rtos)

source: A proprietary safety-critical focussed RTOS
es: Un RTOS de seguridad crítica propietario

source: the temporary implementation [of a feature we proposed](https://github.com/rust-lang/compiler-team/issues/659) and will implement upstream
es: la implementación de [un feature que propusimos](https://github.com/rust-lang/compiler-team/issues/659) y que implementaremos upstream

source: Our build and test infrastructure
es: Nuestra infraestructura de build y test

source: Continuous Test
es: Pruebas continuas

source: We developed our own _Continuous Integration_ infrastructure
es: Desarrollamos nuestra propia infraestructura de _Integración Continua_

source: Separate and parallel to that used by The Rust Project
es: Distinta y paralela al usado por el Proyecto de Rust

source: They have different goals!
es: ¡Tienen metas distintas!

source: Having multiple independent, parallel, rock solid CI pipelines can only benefit Rust
es: Tener varios pipelines de CI paralelos, independientes, y robustos sólo puede beneficiar a Rust

source: Ours produces the artefacts we need for qualification
es: El nuestro produce artefactos que necesitamos para la calificación

source: Some examples
es: Algunos ejemplos

source: Enterprise Linux Distributions are a downstream of The Linux Kernel
es: Las distribuciones Enterprise de Linux son downstream del Kernel de Linux

source: The Linux Kernel makes kernel releases
es: El Kernel de Linux hace releases

source: The Enterprise Linux Vendor then:
es: El Vendedor de Enterprise Linux entonces:

source: takes the source code,
es: toma el código fuente,

source: runs their test suite,
es: corre su suite de tests,

source: adds any required fixes or backports,
es: agrega los fixes o backports necesarios,

source: publishes it as open source, and
es: lo publica como open sorce, y

source: sells their customers binaries with a long-term support package
es: le vende a sus clientes los binarios con soporte de largo plazo

source: Note:
es: Nota:

source: They are a downstream of a whole bunch of open source packages - GCC, glibc, LibreOffice, bash, etc.
es: Son downstream de muchos proyectos open source - GCC, glibc, LibreOffice, bash, etc.

source: It's the same model
es: Es el mismo modelo

source: Ferrocene is a downstream of The Rust Project
es: Ferrocene es downstream del Proyecto de Rust

source: The Rust Project makes toolchain releases
es: El Proyect de Rust hace releases de su toolchain

source: Ferrous Systems then:
es: Ferrous Systems entonces:

source: Yes, Ferrocene is Open Source
es: Sí, Ferrocene es Open Source

source: We think it's the world's first open-source qualified toolchain
es: Creemos que es el primer compilador open source calificado del mundo

source: Yes, there's Long Term Support
es: Sí, hay paquetes de soporte de largo plazo

source: You can buy support on a commercial basis
es: Puedes comprar soporte con un contrato comercial

source: More on this later
es: Más sobre esto al rato

source: Host Platform?
es: ¿Plataforma Host?

source: The machine you can run the toolchain on
es: La máquina en la que corres el toolchain

source: It also has to compile code _for itself_, e.g. proc-macros and `build.rs` files
es: También tiene que compilar el código para _sí mismo_, e.g., proc-macros y `build.rs` files

source: A combination of CPU architecture, Operating System and ABI
es: Una combinación de arquitectura de CPU, Sistema Operativo y ABI

source: The List
es: La Lista

source: Just `x86_64-unknown-linux-gnu` for now
es: Solo `x86_64-unknown-linux-gnu` por ahora

source: We qualified on Ubuntu 18.04 for x86-64
es: Calificamos en Ubuntu 18.04 para x86-64

source: This was driven by the needs of our first client
es: Esto fue impulsado por las necesidades de nuestro primer cliente

source: It comes with GCC 7.5 which is the linker we used for qualification
es: Viene con GCC 7.5 el cual es el linker usado en la calificación

source: More Operating Systems and linkers will be supported in due course
es: Tendremos soporte para más Sistemas Operativos y linkers en su momento

source: But what about $MY_FAVOURITE host
es: Pero y qué de $MI_HOST_FAVORITO

source: Get in touch!
es: ¡Contáctanos!

source: If Rust already runs on there, it's a case of porting our test suite
es: Si Rust ya corre ahí, requiere portear la suite de tests

source: If Rust doesn't already run on there ... we can probably fix that for you
es: Si Rust todavía no correr ahí ... probablemente lo podemos arreglar para tí

source: Target Platform?
es: ¿Plataforma Target?

source: The machine you can run the compiled code on
es: La máquina que corre el código compilado

source: `x86_64-unknown-linux-gnu` (the supported host)
es: `x86_64-unknown-linux-gnu` (el host soportado)

source: "64-bit Arm on bare metal"
es: "64-bit Arm sobre bare metal"

source: `no-std` mode - no Rust `libstd`, only `libcore` and `liballoc`
es: modo `no-std` - sin Rust `libstd`, sólo `libcore` y `liballoc`

source: Driven by our lead client's requirements
es: Impulsado por los requerimientos de nuestros clientes

source: Bring your existing OS and call its C API from Rust
es: Trae tu sistema operativo preexistente y llama su API de C desde Rust

source: Must use the `aarch64-unknown-linux-gnu` GCC 7.5 linker from Ubuntu 18.04
es: Debe usar el linker de `aarch64-unknown-linux-gnu` GCC 7.5 de Ubuntu 18.04

source: With `-ffreestanding` and the other flags in our User Manual
es: Con `-ffreestanding` y otras banderas en nuestro Manual de Usuarios

source: But what about $MY_FAVOURITE target
es: ¿Y qué de $MI_TARGET_FAVORITO?

source: If Rust already targets it, it's a case of porting our test suite
es: Si Rust ya lo permite como target, hay que hacer el porte de la suite de tests

source: If Rust doesn't already target it ... we can probably fix that for you
es: Si Rust todavía no lo tiene como target ... probablemente podemos arreglarlo por tí

source: Quality is a process
es: La calidad es un proceso

source: You can't pour a bucket of quality into a finished product
es: No puedes aventarle calidad extra a un producto terminado

source: It's a process you follow throughout the product life-cycle
es: Es un proceso que sigues durante la vida del producto

source: You might follow a process that is in accordance with a published ISO standard
es: Puede que sigas un proceso que vaya de acuerdo con uno publicado por los estándares de ISO

source: Certification and Qualification
es: Certificación y Calificación

source: You are responsible for **certifying** that the development of _your_ product was in accordance with such a standard.
es: Eres responsable for **certificar** que el desarrollo de _tu_ producto se hizo de acuerdo con dicho estándar.

source: You might choose tools that are **qualified** as being suitable for use with such a standards compliant process.
es: Puedes escoger herramientas ya **calificadas** apropiadamente para ser usadas con un proceso que cumple un proceso estandarizado.

source: What is ISO 26262?
es: ¿Qué es el ISO 26262

source: From [iso.org](https://www.iso.org/standard/68383.html)
es: De [iso.org](https://www.iso.org/standard/68383.html)

source: And that has qualified tools?
es: ¿Y eso tiene herramientas calificas?

source: ISO 26262-8:2018(E), Section 11.1.b says:
es: ISO 26262-8:2018(E), Sección 11.1.b dice:

source: Confidence in your Tools
es: Confíanza en tus herramientas

source: What is the tool supposed to do?
es: ¿Qué debe hacer la herramienta?

source: Does it do what it is supposed to do?
es: ¿Hace lo que se supone que tiene que hacer?

source: Does someone I trust believe it does what it is supposed to do?
es: ¿Alguien en quien yo confío le cree que va a hacer lo que dice que tiene que hacer?

source: Rust doesn't have a written specification ... yet.
es: Rust todavía no tiene una especificación escrita ... aún.

source: So we wrote the Ferrocene Language Specification
es: Así que escribimos la Especificación del Lenguaje de Ferrocene

source: Rust already had an **excellent** test suite
es: Rust ya tiene una **excelente** suite de tests

source: Our work was mainly **joining the dots** between the tests and the specification, and **automating everything**
es: Nuestro trabajo fue en su mayoría **conectar los puntos** entre las tests y la especificación, y **automatizarlo todo**

source: Nothing hits our main branch unless the tests pass
es: Nada llega a nuestra branch de main sin pasar tests

source: We then documented everything in a Safety Manual
es: Después lo documentamos todo en un Manual de Seguridad

source: And I get?
es: ¿Y qué me dan?

source: You can purchase from us the digitally-signed documents as part of a _Qualification Kit_. You can then provide these to _your_ assessor when certifying _your_ development process.
es: Puedes comprarnos los documentos firmados digitalmente como parte de un _Kit de Calificación_. Después puedes proveer esos documentos a _tu_ asesor cuando certifiques _tu_ proceso de desarrollo.

source: But it's also open source
es: Pero también es open source

source: Anyone can inspect the unsigned documents and test matrices in our open-source repository without a contract.
es: Cualquiera puede inspeccionar los documentos no firmados y nuestras pruebas de matrices en nuestro repositorio open-source sin un contrato

source: Ferrocene is open source
es: Ferrocene es open source

source: The Source Code is MIT/Apache-2.0
es: El código fuente es MIT/Apache-2.0

source: The [Ferrocene Language Specification](https://spec.ferrocene.dev) is MIT/Apache-2.0
es: La [Especificación del Lenguaje de Ferrocene](https://spec.ferrocene.dev) es MIT/Apache-2.0

source: You can even [read the Qualification Documents](https://public-docs.ferrocene.dev/main/index.html) right now
es: Hasta puedes [leer los Documentos de Calificación](https://public-docs.ferrocene.dev/main/index.html) ahorita

source: And you sell?
es: ¿Y qué vendes?

source: Binaries
es: Binarios

source: Long-term Support
es: Soporte de largo plazo

source: for Ferrocene
es: para Ferrocene

source: for third-party crates (as an add-on)
es: y para crates de terceros (por aparte)

source: Includes digitally-signed Qualification Documents for your assessor
es: Incluye los Documentos de Calificación firmados digitalmente para tu asesor

source: How long is long-term?
es: ¿Qué tan largo es largo plazo?

source: Upstream Rust only supports each release for six weeks
es: Upstream Rust solo da soporte a cada release por 6 semanas

source: There are no backports to old stable releases
es: No hay backports a releases viejos y estables

source: We pick a _rolling_ release, _stabilise_ it, and support it for 2 years
es: Escogemos un _rolling_ release, lo _estabilizamos_ y le damos soporte por 2 años

source: We give subscribers bug-fix releases as we fix bugs
es: Le damos a los suscriptores releases de bug-fixes a medida los encontramos

source: After 2 years it goes into Extended Support
es: Después de 2 años entra a Soporte Extendido

source: We tell subscribers about issues and give possible workarounds
es: Le decimos a nuestros suscriptores sobre issues y posibles mitigaciones

source: Roadmap
es: Plan a futuro

source: Terminology
es: Terminología

source: How much is it?
es: ¿Cuánto cuesta?

source: Access to the open-source code is free
es: Acceder al código open source es gratis

source: Includes the source code of the Qualification Documentation
es: Incluye el código fuente de los Documentos de Calificación

source: If you cancel, you can keep the binaries you already have
es: Si cancelas, te quedas con los binarios que ya tienes

source: Early access available now, for users wanting 10 seats or more
es: Existe acceso temprano, para usuarios que quieras 10 plazas o más

source: Pricing for support and signed Qualification Documents is POA
es: Precio de soporte y Documentos de Calificación son POA

source: We will be happy to discuss your project and your exact needs
es: Felizmente podemos platicar sobre su próximo proyecto y sus necesidades precisas

source: Is there a USB dongle?
es: ¿Hay un dongle de USB?

source: You get a username and password to a download area
es: Obtienes un usuario y contraseña para el área de descarga

source: Your binaries are legally restricted but not physically restricted
es: Tus binarios están legalmente restringidos pero no físicamente restringidos

source: They are designed to be used in your CI system!
es: ¡Están diseñados para ser usados en tu sistema de Integración Continua!

source: Ships as tarballs
es: Se publica en tarballs

source: Unpack tarballs into, e.g. `/opt/ferrocene-23.06`
es: Desempacas a, e.g., `/opt/ferrocene-23.06`

source: Step-by-step
es: Paso a paso

source: Set up Ubuntu 18.04 for AMD64
es: Set up para Ubuntu 18.04 en AMD64

source: Install:
es: Instala:

source: `gcc` and `build-essential`
es: `gcc` y `build-essential`

source: Modify `~/.bashrc` to put `/opt/ferrocene-23.06/bin` in your `$PATH`
es: Modifica `~/.bashrc` para poner `/opt/ferrocene-23.06/bin` en tu `$PATH`

source: I use Docker for this. YMMV.
es: Usé Docker para esto, YMMV.

source: Installing in the future
es: Instalando en el futuro

source: We have `criticalup` - like `rustup` but for fetching, verifying and installing digitally signed Ferrocene tarballs using your subscriber credentials.
es: Tenemos `criticalup` - como `rustup` pero para descargar, verificar e instalar tarballs de Ferrocene firmadas digitalmente usando tus credenciales de suscriptor.

source: You can also use `criticalup` to fetch and verify the install tarballs, ready for transfer to a non-Internet-connected computer for installation there.
es: También puedes usar `criticalup` para obtener y verificar los tarballs, y de ahí transferirlos a una computadora no conectada al internet para instalarlos ahí.

source: What do you get?
es: ¿Y qué consigues?

source: Is that docs?
es: ¿Eso es documentación?

source: Also available online
es: También disponible en línea

source: See <https://public-docs.ferrocene.dev>
es: Ver <https://public-docs.ferrocene.dev>

source: ![The docs page](./images/docs1.png)
es: ![La página de docs](./images/docs1.png)

source: ![The docs page](./images/docs2.png)
es: ![La página de docs](./images/docs1.png)

source: ![The docs page](./images/docs3.png)
es: ![La página de docs](./images/docs3.png)

source: The demo
es: El demo

source: I have the `aarch64-unknown-none` target
es: Tengo el target de `aarch64-unknown-none`

source: I want run to run a binary on an ARMv8-A machine in Aarch64 mode
es: Quiero correr un binario en una máquina ARMv8-A en modo Aarch64

source: I'm using QEMU
es: Estoy usando QEMU

source: I'll need a UART driver so you can see the output
es: Necesitaré el driver de UART para que puedan ver el output

source: I'll need some assembly code to boot the chip
es: Necesitaré algo de ensamblador para bootear el chip

source: All the demo source code is available
es: Todo el código fuente del demo está disponible

source: Building the demo
es: Construyendo el demo

source: You can build this with `cargo build`
es: Lo puedes construir con `cargo build`

source: You can drive `rustc` manually with `$MY_FAVOURITE` build system
es: Puedes ejecutar `rustc` manualmente con `$MI_SISTEMA_DE_BUILD_FAVORITO`

source: I show both
es: Mostraré ambos

source: The boot.S file
es: El archivo boot.S

source: Set the stack pointer, jump to a symbol called `kmain`.
es: Ponemos el pointer del stack, saltamos al símbolo llamado `kmain`.

source: The skeleton
es: El esqueleto

source: We turned off name-mangling with `#[no_mangle]` so `boot.S` could jump to `kmain`. We also set the function to have `C` linkage (i.e. use a C compatible ABI), like assembly branch assumed.
es: Desactivamos el name-mangling con `#[no_mangle]` para que `boot.S` pueda saltar a `kmain`. También permitimos que la función tenga linkage de `C` (i.e. usar un C compatible ABI), como lo asume el ensamblador.

source: The UART
es: El UART

source: Writing to the UART
es: Escribiendo al UART

source: Handling panics
es: Manejando panics

source: Some application code
es: Algo de código de aplicación

source: And fixing up kmain
es: Y arreglando el kmain

source: Let's run it
es: Corrámoslo

source: Wait, how did boot.S get assembled?
es: Espera, como se ensambló boot.S?

source: There's a long and boring `build.rs` file which shells out to `as` and `ar` to assemble `boot.S` into `libboot.a`.
es: Hay un largo y aburrido archivo `build.rs` que manda llamar `as` y `ar` para ensamblar `boot.S` en `libboot.a`.

source: If you don't want to use cargo
es: Por si no quieres usar cargo

source: # snip some variable set up...
es: # omitimos algo de setup

source: Any Questions?
es: ¿Alguna pregunta?
